wouyanglv/ble-archives/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/eeg_emg_v1_samplespacked/main.c
    // Initialize timer module.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    // Create timers.
    err_code = app_timer_create(&m_power_level_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                power_level_meas_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_startup_delay_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                startup_delay_timeout_handler);
    APP_ERROR_CHECK(err_code);
}

char *uint64_to_string (uint64_t input)
{
     static char result [21] = "";
     memset(&result [0], 0, sizeof(result));
     char temp [21] = "";
     char c;
     uint8_t base=10;

     while (input)
     {
        int num=input % base;
        input /= base;
        c= '0' + num;

        sprintf(temp, "%c%s", c, result);
        strcpy(result, temp);
     }
     return result;
}

/** @brief: Returns the timestamp (since power up) in usecs.
 */
static uint64_t rtc_timestamp_get()
{
    uint64_t ticks;
    uint64_t timestamp;

    ticks = nrfx_rtc_counter_get(&m_rtc);
    timestamp = ((m_rtc_overflows << RTC_BIT_WIDTH) + ticks) * m_ns_per_tick;

    return timestamp;
}


/** @brief: Function for handling the RTC2 interrupts.
 * Triggered on TICK and OVERFLOW match.
 */
static void rtc_handler(nrfx_rtc_int_type_t int_type)
{
    if (int_type == NRFX_RTC_INT_OVERFLOW)
    {
        //keep track of overflow count to determine time since start
        m_rtc_overflows++;
        nrf_rtc_event_clear(m_rtc.p_reg, NRF_RTC_EVENT_OVERFLOW);
    }
    else if (int_type == NRFX_RTC_INT_TICK)
    {
        //first tick, clear counter and continue initialization
        nrf_rtc_event_clear(m_rtc.p_reg, NRF_RTC_EVENT_TICK);
        nrfx_rtc_tick_disable(&m_rtc);
        nrfx_rtc_counter_clear(&m_rtc);
//        rtc_timestamp_get();  //display current
        m_rtc_init = true;
    }
}


/** @brief Function initialization and configuration of RTC driver instance.
 */
static void rtc_config(void)
{
    uint32_t err_code;

    m_rtc_init = false;
    m_rtc_overflows = 0;
    float sec_per_tick = ( ((float)APP_TIMER_CONFIG_RTC_FREQUENCY + 1.0f) ) / (float)NRFX_RTC_DEFAULT_CONFIG_FREQUENCY;
    m_ns_per_tick = sec_per_tick * TIMESTAMP_PRECISION;
    SEGGER_RTT_printf(0,"sec per tick: %f\r\n", sec_per_tick);
    SEGGER_RTT_printf(0,"m_ns_sec per tick: %d\r\n", m_ns_per_tick);


    //Initialize RTC instance
    nrfx_rtc_config_t config = NRFX_RTC_DEFAULT_CONFIG;
    config.prescaler = 0;
    err_code = nrfx_rtc_init(&m_rtc, &config, rtc_handler);
    APP_ERROR_CHECK(err_code);

    //Power on RTC instance
    nrfx_rtc_counter_clear(&m_rtc);
    nrfx_rtc_overflow_enable(&m_rtc, true);
    nrfx_rtc_tick_enable(&m_rtc, true);
    nrfx_rtc_enable(&m_rtc);
}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_HEART_RATE_SENSOR_HEART_RATE_BELT);
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief GATT module event handler.
 */
static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
    if (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)
    {
        NRF_LOG_INFO("GATT ATT MTU on connection 0x%x changed to %d.",
                     p_evt->conn_handle,
                     p_evt->params.att_mtu_effective);
    }

    ble_hrs_on_gatt_evt(&m_biosig_svc, p_evt);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing services that will be used by the application.
 *
 * @details Initialize the BioSignal, Battery and Device Information services.
 */
static void services_init(void)
{
    ret_code_t         err_code;
    ble_biosig_svc_init_t     biosig_svc_init;
    ble_bas_init_t     bas_init;
    ble_dis_init_t     dis_init;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Bio Signal Service.
    memset(&biosig_svc_init, 0, sizeof(biosig_svc_init));

    biosig_svc_init.evt_handler = NULL;
    biosig_svc_init.cccd_wr_sec = SEC_OPEN;
    biosig_svc_init.rd_sec = SEC_OPEN;

    err_code = ble_biosig_svc_init(&m_biosig_svc, &biosig_svc_init);
    APP_ERROR_CHECK(err_code);

    // Initialize Battery Service.
    memset(&bas_init, 0, sizeof(bas_init));

    bas_init.evt_handler          = NULL;
    bas_init.support_notification = true;
    bas_init.p_report_ref         = NULL;
    bas_init.initial_batt_level   = 100;

