wouyanglv/ble-archives/nRF5_SDK_17.0.0_9d13099/examples/ble_peripheral/eeg_emg_v1_samplespacked/main.c
#ifndef SEND_BLE
        // Send and display received samples
        /*for (i=0; i < num_samples; i++)
        {SEGGER_RTT_printf(0, "Entered loop!%d\r\n",i);
            sample_timestamp = last_sample_timestamp - (num_samples- i - 1) * MAX30003_SAMPLE_PERIOD_US;
            m_sample_num[dev_type]++;*/

            // send sample over BLE
            err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, last_sample_timestamp, 
                                    num_samples, ecgSamples, dev_type);

            while (err_code == NRF_ERROR_RESOURCES) 
            {
                nrf_delay_ms(100);
                retry_ble_send = true;
                SEGGER_RTT_printf(0, "SEND STATUS TRYING\r\n");
                err_code = ble_biosig_svc_measurement_send(&m_biosig_svc, last_sample_timestamp, 
                                    num_samples, ecgSamples, dev_type);
            }
            if ((err_code != NRF_SUCCESS) &&
                (err_code != NRF_ERROR_INVALID_STATE) &&
                (err_code != NRF_ERROR_RESOURCES) &&
                (err_code != NRF_ERROR_BUSY) &&
                (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
               )
            {
                APP_ERROR_HANDLER(err_code);
            }

            //display timestamp + sample
            //float floatNumber = (float)sample_timestamp/1000000.0f;
           // uint32_t intPart = (uint32_t)floatNumber;
           // uint32_t decimalPart = (floatNumber - intPart) * 1000000;
            //if (m_sample_num[dev_type] % 1000 == 0 || retry_ble_send)
               // SEGGER_RTT_printf(0, "%d :: %d.%d :: %d\r\n", (uint32_t)m_sample_num[dev_type], intPart, decimalPart, ecgSamples[i]);
#endif
    }
    else if ((status & EOVF_STATUS) == EOVF_STATUS)
    {
        max30003_reset_fifo(dev); // Reset FIFO
        SEGGER_RTT_printf(0, "Pre-read FIFO overflow!\r\n");
    }

    // Check if FIFO overflowed while we were sending BLE data, if so reset the FIFO
    ret = max30003_get_status(dev, &status);      // Read the STATUS register
    if ((status & EOVF_STATUS) == EOVF_STATUS)
    {
        max30003_reset_fifo(dev); // Reset FIFO
        SEGGER_RTT_printf(0, "Reset FIFO\r\n");
    }
}


/**@brief Function for application main entry.
 */
int main(void)
{
 
    bool erase_bonds;

    // Initialize timers
    log_init();
    timers_init();

    // Delay startup to allow power harvesting to ramp up
    lfclk_request();  //turn on here because we need it before softdevice is started
    m_startup_delay = true;
    ret_code_t err_code = app_timer_start(m_startup_delay_timer_id, STARTUP_DELAY, NULL);
    APP_ERROR_CHECK(err_code);

    SEGGER_RTT_printf(0, "Waiting for startup delay...\r\n");

    while (m_startup_delay) 
    { 
        idle_state_handle();
    }

    SEGGER_RTT_printf(0, "Past startup delay\r\n");

    // Remainder of initialization
    rtc_config();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    advertising_init();
    services_init();
    conn_params_init();
    peer_manager_init();

    // Start execution.
    NRF_LOG_INFO("EEG/EMG monitoring started.");
    application_timers_start();
    advertising_start(erase_bonds);

    // wait for RTC to finish initializing
    while (!m_rtc_init) 
    { 
        idle_state_handle();
    }

    spi_init();

#if USE_EEG
    //initialize the EEG device
    m_eeg_dev.spi_instance_id = EEG_SPI_INSTANCE;
    m_eeg_dev.spi_xfer = spi_transfer;
    max30003_init(&m_eeg_dev);

    SEGGER_RTT_printf(0, "Done EEG init!\r\n");
#endif

#if USE_EMG
    //initialize the EMG device
    m_emg_dev.spi_instance_id = EMG_SPI_INSTANCE;
    m_emg_dev.spi_xfer = spi_transfer;
    max30003_init(&m_emg_dev);

    SEGGER_RTT_printf(0, "Done EMG init!\r\n");
#endif

    SEGGER_RTT_printf(0, "Init done.\r\n");
//    SEGGER_RTT_printf(0, "Waiting for BLE connection...\r\n");

//    while (1)
//    {
//        idle_state_handle();
//    }

    m_sample_num[EEG_SPI_INSTANCE] = 0;
    m_sample_num[EMG_SPI_INSTANCE] = 0;

#if USE_EEG
    m_eeg_data_avail = false;
    max30003_start_data(&m_eeg_dev, eeg_data_avail_handler);
#endif

#if USE_EMG
    m_emg_data_avail = false;
    max30003_start_data(&m_emg_dev, emg_data_avail_handler);
#endif

//    if (!nrfx_gpiote_is_init())
//    {
//        err_code = nrfx_gpiote_init();
//        APP_ERROR_CHECK(err_code);
//    }
//    nrfx_gpiote_out_config_t config = NRFX_GPIOTE_CONFIG_OUT_SIMPLE(NRF_GPIOTE_INITIAL_VALUE_HIGH);
//    err_code = nrfx_gpiote_out_init(17, &config);
//    APP_ERROR_CHECK(err_code);

    // Enter main loop.
    while (1)
    {
//        nrfx_gpiote_out_toggle(17);
//        nrf_delay_ms(500);

//        uint32_t info;
//        max30003_get_info(&m_eeg_dev, &info);

        if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
        { 
           
            if (m_emg_data_avail)
            {
                read_sensor_data(&m_emg_dev, BLE_BIOSIG_DEV_TYPE_EMG);
                m_emg_data_avail = false;
            } 
             if (m_eeg_data_avail)
            {

                read_sensor_data(&m_eeg_dev, BLE_BIOSIG_DEV_TYPE_EEG);
                m_eeg_data_avail = false;
            }
        }

#ifdef NRF52_DK
        bsp_board_led_invert(BSP_BOARD_LED_3);
#endif

//        idle_state_handle();
    }
}
